---
kind: type
id: T:Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServerIds
source: html/0f801901-9d39-e079-f12c-aa90fc0124d8.htm
---
# Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServerIds

Ids for external servers implementing path of travel calculations.

## Syntax (C#)
```csharp
public static class PathOfTravelCalculationServerIds
```